/*********************************************************************/
/*                                                                   */
/*                   SSP_M25P128.h                                   */
/*                                                                   */
/*********************************************************************/
#ifndef __SSP_M25P128_H
#define __SSP_M25P128_H
/*********************************************************************/
/*                                                                   */
/*                                                                   */
/*                                                                   */
/*********************************************************************/
#include "lpc_types.h"
#include "LPC177x_8x_ssp.h"
/*********************************************************************/
/*                                                                   */
/*                                                                   */
/*                                                                   */
/*********************************************************************/
/*字模计算公式:(区码-0xa0)*94+(位码-0xa0)-95)*字模长度+字模首地址*/
#define ASC16_BASE 0x00000080
#define HZK16_BASE 0x00000886
#define ASC24_BASE 0x000406CC
#define HZK24_BASE 0x00041ED2
#define ASC28_BASE 0x000D1AE8
#define HZK28_BASE 0x000D36EE
#define ASC36_BASE 0x001B30D4
#define HZK36_BASE 0x001B66DA
#define ASC48_BASE 0x0031DD08
#define HZK48_BASE 0x0032250E
#define ASC72_BASE 0x00561554
#define HZK72_BASE 0x0056C95A

#define _USING_SSP		(LPC_SSP1)
/*********************************************************************/
/*                                                                   */
/*                                                                   */
/*                                                                   */
/*********************************************************************/
extern void M25P128_Read(uint32_t Add,uint8_t *DataBuffer,uint32_t Length);
extern void M25P128_SSP_Init(void);
#endif

